[
  {
    "text": "Happiness depends upon ourselves.",
    "meaning": "Joy comes largely from your own decisions and actions.",
    "exercise": "Write down one thing you can control today and act on it."
  },
  {
    "text": "The biggest problem in communication is the illusion that it has taken place.",
    "meaning": "People often assume they were clear when they weren’t.",
    "exercise": "Ask someone to repeat back what they understood."
  },
  {
    "text": "It does not matter how slowly you go as long as you do not stop.",
    "meaning": "Steady progress is better than rushing and quitting.",
    "exercise": "Work on a goal for just two minutes today."
  },
  {
    "text": "You are loved.",
    "meaning": "Your boyfriend loves you so much.",
    "exercise": "Ask him to show you his love."
  },
  {
    "text": "Be yourself; everyone else is already taken.",
    "meaning": "Trying to copy others prevents you from living your own life.",
    "exercise": "List one personal trait you’re proud of."
  },
  {
    "text": "If you’re going through hell, keep going.",
    "meaning": "Hard moments pass if you stay in motion.",
    "exercise": "Take one small step toward solving a problem."
  },
  {
    "text": "Happiness is not something ready made. It comes from your actions.",
    "meaning": "Joy comes from habits, not chance.",
    "exercise": "Do one small act of kindness today."
  },
  {
    "text": "Seek first to understand, then to be understood.",
    "meaning": "Good communication starts with listening.",
    "exercise": "Ask a clarifying question during your next conversation."
  },
  {
    "text": "I can’t decide what I love more about you, your smile, your laugh… or the way you make my thoughts go places they probably shouldn’t in public..",
    "meaning": "It’s flirty, teasing, and let you know you have a strong effect on him.",
    "exercise": "..."
  },
  {
    "text": "Understanding is another name for love.",
    "meaning": "Real connection begins with empathy.",
    "exercise": "Ask someone what they need today."
  },
  {
    "text": "Owning your story and loving yourself through it is an act of courage.",
    "meaning": "Self-acceptance takes bravery but leads to strength.",
    "exercise": "Write down one flaw you’ll treat gently today."
  },
  {
    "text": "The world is full of suffering, but also full of overcoming it.",
    "meaning": "Hardship exists, but so does strength.",
    "exercise": "Remember a challenging moment you overcame."
  },
  {
    "text": "Happiness is not a goal… it's a by-product.",
    "meaning": "Joy comes from meaningful action, not chasing joy itself.",
    "exercise": "Spend 10 minutes doing something meaningful."
  },
  {
    "text": "Wise people speak because they have something to say.",
    "meaning": "Intentional communication is more powerful.",
    "exercise": "Pause one second before responding."
  },
  {
    "text": "Absorb what is useful, discard what is not.",
    "meaning": "Improvement comes from filtering and tailoring what you learn.",
    "exercise": "Keep one idea from today and discard one unnecessary one."
  },
  {
    "text": "Love is the only force capable of transforming conflict.",
    "meaning": "Kindness helps resolve tension more than force.",
    "exercise": "Practice a small act of patience toward someone difficult."
  },
  {
    "text": "The privilege of a lifetime is becoming who you truly are.",
    "meaning": "Being authentic is one of life’s great achievements.",
    "exercise": "Write down one truth about yourself you appreciate."
  },
  {
    "text": "The greatest glory lies in rising every time we fall.",
    "meaning": "Setbacks don’t define you—recovering does.",
    "exercise": "Turn one past failure into a written lesson."
  },
  {
    "text": "Happiness comes from choosing the right actions each day.",
    "meaning": "Daily behavior shapes your mood over time.",
    "exercise": "List one good choice you’ll make today."
  },
  {
    "text": "We have two ears and one mouth so we can listen more than we speak.",
    "meaning": "Listening is the most important communication skill.",
    "exercise": "Let someone finish speaking before you reply."
  },
  {
    "text": "Continual growth gives life meaning.",
    "meaning": "Improvement never stops; it expands your potential.",
    "exercise": "Set one micro-goal for this week."
  },
  {
    "text": "Love helps you see others at their deepest level.",
    "meaning": "Understanding someone requires genuine care.",
    "exercise": "Give one person your full attention for five minutes."
  },
  {
    "text": "Man suffers because he takes everything too seriously.",
    "meaning": "Relaxing helps you accept yourself more easily.",
    "exercise": "Take a slow, deep breath and soften your posture."
  },
  {
    "text": "I have not failed; I’ve just found ways that don’t work.",
    "meaning": "Mistakes are data, not personal flaws.",
    "exercise": "Write down one mistake you learned from today."
  }
]